Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: མདོ་སྡེ་བྱེ་བ་སྟོང་ཕྲག་ཐུག་པ་མེད་འཆད་ཀྱང་། །དེ་ནི་དོན་དང་ཚིག་འབྲུ་གང་ལའང་ཆགས་པ་མེད། །
en: May explain a vast number of sūtras without barrier, They are not hampered regarding any meanings or syllables.

source: ཡིད་འོང་ཤིན་ཏུ་སྙན་ཅིང་ཆགས་པར་འགྱུར་བའི་དབྱངས། །བྱེ་བ་སྟོང་ཕྲག་ཚད་མེད་ཞིང་དུ་གོ་བྱེད་པ། །
en: “Delightful, melodious, and attractive melodies Foster understanding in vast numbers of buddhafields.

source: སེམས་ཅན་རྣམས་ཀྱིས་དེ་ཐོས་མྱ་ངན་འདས་པར་འགྲོ། །
en: Hearing it, sentient beings progress toward nirvāṇa.

source: སྒྲ་དབྱངས་རྣམ་པར་དག་པའི་གཟུངས་འདི་ཐུག་པ་མེད། །
en: The pure melody dhāraṇī is limitless.

source: ཡི་གེ་ཐམས་ཅད་ཤེས་པ་མཁས་པ་བློ་གྲོས་ལྡན། །
en: (2) “While learned and wise ones who know all linguistic forms

source: བསྐལ་པ་མང་པོར་འཆད་ཀྱང་ཆོས་ལ་ཟད་པ་མེད། །
en: May teach for many eons, they do not run out of Dharma.

source: རྩ་བའི་ཚིག་གཅིག་བརྗོད་པའང་ཟད་པར་མི་འགྱུར་ཏེ། །
en: As they pronounce a single basic word, it becomes inexhaustible.

source: མི་ཟད་ཆོས་ཀྱི་ཟ་མ་ཏོག་འདི་དྲན་པ་ཡི། །
en: This is the dhāraṇī of the inexhaustible basket.

source: གང་གིས་གཟུངས་ཐོབ་མཐའ་མར་ཐུག་པར་ཡོངས་བཅད་པ། །
en: (3) “Wise ones who attain the dhāraṇī, whose positive determination has reached the limit of reality,

source: མཉམ་ཉིད་ཚུལ་བཞིན་ཆོས་ལ་སེམས་པ་བློ་གྲོས་ལྡན། །
en: Are intent on the teachings that are authentic and appropriate.

source: མཐར་འཛིན་ཐམས་ཅད་རྣམ་པར་སྤངས་ཏེ་ཡོངས་དག་པས། །
en: These leaders have abandoned and thus purified all extreme beliefs,

source: ཁྱུ་མཆོག་གྱུར་པ་དེ་ནི་དབུས་ལ་གནས་མི་འགྱུར། །
en: Yet they do not become stuck in the middle.

source: གང་གིས་མཚོ་ཆེན་ཕྱག་རྒྱའི་གཟུངས་ནི་རབ་ཐོབ་པ། །དེ་ཡི་ཁ་ནས་ཕྱག་རྒྱ་བསམ་ཡས་རྗོད་པ་ན། །
en: (4) “When they have attained the great ocean mudrā, Having discussed it and described the inconceivable seals,

source: གང་དག་གླིང་བཞི་གཟུགས་ཀྱི་རྣམ་པ་ཇི་སྙེད་པ། །དེ་དག་ཀུན་དང་རྒྱ་མཚོ་མཚོ་ཆེན་བཅས་མི་རྟོག །
en: All the forms in the four continents Possess the great ocean that is nonconceptuality.

source: འཁོར་དུ་གལ་ཏེ་བདག་ཉིད་ཆེན་པོ་དེ་ཆོས་སྟོན། །
en: (5) “When great beings teach the Dharma to an audience,

source: ནམ་མཁའ་ལས་ནི་པད་མ་དག་གི་ཆར་ཆེན་འབབ། །པད་མ་དག་ལས་ཆོས་མང་བྱེ་བ་རབ་ཏུ་འབྱུང་། །
en: A vast shower of lotus flowers falls from the sky And a multitude of teachings manifest from them.

source: འདི་ནི་པད་མ་བཀོད་པའི་གཟུངས་ཏེ་ཡོངས་སུ་དག །
en: This is the pure lotus array dhāraṇī.

source: ཆགས་པ་མེད་པའི་གཟུངས་ནི་གལ་ཏེ་ཐོབ་གྱུར་ན། །
en: (6) “When they have attained the nonattachment dhāraṇī,

source: ཚིག་གཅིག་བརྗོད་པ་རབ་ཏུ་སྨྲ་དང་གཉིས་དག་དང་། །གསུམ་དང་བཞི་དང་ལྔ་དང་བྱེ་བ་དག་དང་ནི། །ཁྲག་ཁྲིག་ཐུག་པ་མེད་པར་སྨྲ་ལ་ཆགས་པ་མེད། །
en: They have no attachment in speaking, whether expressing a single word Or two, three, four, five, a million, A hundred thousand million, or an endless number of words.

source: གང་གིས་རྣམ་པར་གདོན་མི་ཟ་བའི་གཟུངས་ཐོབ་པ། །དོན་དང་ཆོས་དང་ངེས་ཚིག་སྤོངས་པ་ཇི་སྙེད་པ། །ཕྱོགས་བཅུའི་སེམས་ཅན་ཇི་སྙེད་མང་པོས་ཡོངས་དྲིས་ན། །དེ་དག་ཐེ་ཚོམ་ཀུན་བཅད་དོགས་པ་མེད་པར་འགྱུར། །
en: (7) “When they have attained the dhāraṇī that transcends doubt And are requested by the multitudes of beings of the ten directions, Then, regarding the entire range of meaning, phenomena, etymology, and eloquence, All the doubts of these beings are dispelled, and their anxieties disappear.

source: གང་གིས་སངས་རྒྱས་རྣམ་པར་འཕྲུལ་པའི་གཟུངས་ཐོབ་པ། །གཟི་བརྗིད་ཆེན་པོ་དེ་ནི་སྟན་ལ་འདུག་པ་ན། །སངས་རྒྱས་ཕྱག་གཡས་དེ་ཡི་སྤྱི་བོར་འཇོག་མཛད་དེ། །དེ་ཡང་རྒྱལ་བའི་སྤོབས་པ་ཅི་འདྲ་བཞིན་དུ་འགྱུར། །
en: (8) “When they have attained the dhāraṇī of the buddhas’ magical display, And this great brilliant one is seated on his throne, The Buddha places his right hand upon their heads And they become just as eloquent as the Victor himself.

source: གང་གིས་གཟུངས་རྣམས་འདི་དག་རབ་ཏུ་ཐོབ་འགྱུར་བ། །
en: “When they have attained these dhāraṇīs,

source: དེ་ཡི་ཡོན་ཏན་བསམ་ཡས་ཐུག་པ་མེད་འགྱུར་ཏེ། །
en: Their qualities become inconceivable and endless.

source: གང་གཱའི་སྙེད་ཀྱི་བསྐལ་པ་བྱེ་བ་སྟོང་བརྗོད་ཀྱང་། །ཁྱུ་མཆོག་གྱུར་པའི་བསྔགས་པ་བརྗོད་པས་ཟད་པ་མེད། །
en: Even if they were described for eons ten million times the extent of Ganges, Since they express tribute to the supreme leader, there would be no end.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ཡི་ཤེས་པ་སྲིད་པ་གསུམ་ལ་མཉམ་འཇུག་སྟེ། །
en: Their knowledge will engage the three realms equally. “When they have attained the supreme dhāraṇīs,

source: པད་མ་བཞིན་དུ་སྲིད་པ་གསུམ་ལས་འཕགས་འགྱུར་ཞིང་། །
en: They rise above the three existences like lotuses.

source: རི་རབ་བཞིན་དུ་ཡུལ་རྣམས་ཀྱིས་ནི་མི་བསྐྱོད་འགྱུར། །
en: They are unshaken by any object, just like Mount Meru.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་སྲིད་ཀུན་རྣམ་པར་སྤངས་པའི་སྤྱད་སྤྱོད་དེ། །
en: “When they have attained the supreme dhāraṇīs, They behave in a way that leaves all worldliness behind.

source: མུ་སྟེགས་ཅན་གྱི་ཚོགས་ཀུན་འཇོམས་པ་སྒྲོག་པ་ན། །སེང་གེ་བཞིན་དུ་འཁོར་དུ་འཇིགས་པ་མེད་པར་འགྱུར། །
en: When they address gatherings of non-Buddhists to quell them, They are without fear of the audience, like a lion.

source: ས་ལྟར་དགེ་བ་རྣམས་ནི་རྣམ་པར་སྐྱེད་པར་འགྱུར། །
en: “Like earth, the dhāraṇīs make virtues grow.

source: ཆུ་ལྟར་དྲི་མ་རྣམས་ནི་རབ་ཏུ་དེད་པར་འགྱུར། །
en: Like water, they rinse away stains.

source: མེ་ལྟར་རློམ་སེམས་མེད་ཅིང་རྣམ་རྟོག་མེད་པར་འགྱུར། །
en: Like fire, they incinerate arrogance and conceptualization.

source: རླུང་ལྟར་ཡུལ་རྣམས་ལ་ནི་ཆགས་པ་མེད་པར་འགྱུར། །
en: Like air, they are unobstructed by directions.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་སྨྲ་ཚེ་ཤེས་དང་དབང་པོ་འཁྲུག་པ་མེད། །
en: “When they have attained the supreme dhāraṇīs, Their knowledge and faculties are unagitated when they speak.

source: དེ་ནི་སྨན་པ་བཞིན་དུ་འགྲོ་བ་ཐར་བྱེད་འགྱུར། །ཕན་པར་འདོད་པས་ཆོས་ཀྱི་བཀྲུ་སྨན་སྦྱིན་པར་བྱེད། །
en: They bring liberation to beings like medicine, And, wishing to help them, they dispense the diuretic of Dharma.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །སྐྱེ་བོའི་ཚོགས་རྣམས་དེ་ལ་ལྟ་བས་མི་ངོམས་ཏེ། །
en: “When they have attained the supreme dhāraṇīs, Throngs of beings never tire of gazing at them.

source: ཟླ་བ་བཞིན་དུ་དགེ་བ་དག་ནི་རྣམ་སྦྱོང་འགྱུར། །སེམས་སྙོམས་གཟི་བརྗིད་ཆེན་པོ་འོད་ཟེར་མཉམ་པར་གཏོང་། །
en: Like the moon, and with pure training in virtues, Their mental equanimity emits a steady brilliant light.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་འགྲོ་བའི་སྲིད་པ་མ་ལུས་སྐེམས་པར་བྱེད། །
en: “When they have attained the supreme dhāraṇīs, They dry up each and every existence of beings.

source: ཉི་མ་བཞིན་དུ་འོད་བྱེད་མུན་པ་སེལ་བར་འགྱུར། །གཉིད་ལོག་སེམས་ཅན་སྲིད་པ་གསུམ་ལས་སད་པར་བྱེད། །
en: Like the sun, and generating light that dispels darkness, They wake the slumbering beings in the three existences.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་ཀུན་ལ་ཆུང་ཟད་ཙམ་ཡང་འཛིན་པ་མེད། །
en: “When they have attained the supreme dhāraṇīs, There is not the slightest clinging to anything.

source: དེ་ནི་རྒྱལ་པོ་བཞིན་དུ་འཇིག་རྟེན་དབང་ཕྱུག་ཆེ། །རྣམ་ཐོས་བུ་བཞིན་ནོར་ལྡན་ཆོས་རྣམས་སྟོན་པར་བྱེད། །
en: Like a king, and being great world rulers like Vaiśravaṇa, They display the riches of the teachings.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །རྫུ་འཕྲུལ་ཆེན་པོ་དྲན་ལྡན་ཀླུ་དང་འདྲར་འགྱུར་ཏེ། །
en: “When they have attained the supreme dhāraṇīs, They resemble nāgas, mindful of great miracles.

source: སྤྲིན་གྱི་བྱ་བ་བྱེད་ཅིང་མཁའ་ལས་གློག་ཕྱུང་ནས། །
en: When clouds billow and lightning appears in the sky,

source: ཞི་བར་བྱ་ཕྱིར་དེ་ནི་ཆོས་ཀྱི་ཆར་པ་འབེབས། །
en: They rain down showers of Dharma in order to bring peace.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །འཁོར་རྣམས་ཐམས་ཅད་ཁྱུ་མཆོག་གྱུར་པའི་གདོང་དུ་བལྟ། །
en: “When they have attained the supreme dhāraṇīs, All audiences will gaze upon their faces as supreme leaders.

source: བརྒྱ་བྱིན་བཞིན་དུ་དམན་པ་མ་ཡིན་གཟུགས་མཆོག་ལྡན། །བློ་ཆེན་འགྲོ་བ་རྣམས་ལ་ཆོས་དང་དོན་རྣམས་སེམས། །
en: Having a supreme form like Śakra, not a mediocre one, The wise ones consider the Dharmas and aims pertaining to beings.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་ཚངས་པའི་གནས་པ་ཡོངས་དག་བསམ་གཏན་བྱེད། །
en: “When they have attained the supreme dhāraṇīs, They meditate on the pure abodes of Brahmā.

source: ཚངས་པ་བཞིན་དུ་མཉམ་བཞག་སྙིང་རྗེ་ལྡན་པར་འགྱུར། །
en: Like Brahmā, their equipoise is compassionate.

source: འཇིག་རྟེན་འདི་ཀུན་ཟིལ་གྱིས་མནན་ནས་བསམ་གཏན་བྱེད། །
en: Outshining all the worlds, they meditate.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་ཕྱོགས་བཅུའི་སངས་རྒྱས་མང་ལ་མཆོད་པ་བྱེད། །
en: “When they have attained the supreme dhāraṇīs, They venerate the many buddhas of the ten directions.

source: དེ་ནི་རྟག་ཏུ་མངོན་ཤེས་ལྔ་ལས་ཉམས་མི་འགྱུར། །
en: They never regresses from the five types of superknowledge.

source: ཞིང་བརྒྱ་བསམ་གྱིས་མི་ཁྱབ་དག་ཏུ་མཁའ་ནས་འགྲོ། །
en: They traverse inconceivable hundreds of buddhafields through pure space.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་རིང་པོར་མི་ཐོགས་སངས་རྒྱས་ཡོན་ཏན་འཐོབ། །
en: “When they have attained the supreme dhāraṇīs, It will not be before long before they attain buddha qualities.

source: ཕྱོགས་ན་རྒྱལ་བ་རྣམས་ནི་དེ་ཡི་བསྔགས་བརྗོད་དེ། །
en: The victors of the directions will express their approval of this

source: བུ་གཅིག་པ་ཞིག་ཡོན་ཏན་ལྡན་པ་བཞིན་དུ་བསྟོད། །
en: And praise them like their only gifted child.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ཡི་སྤོབས་པ་ཕྲེང་བ་ལེགས་བརྒྱུས་ཇི་བཞིན་ཏེ། །
en: “When they have attained the supreme dhāraṇīs, Their eloquence is like a well-strung rosary.

source: མདོ་སྡེ་ཟབ་མོ་སྣ་ཚོགས་མང་པོ་འཆད་པ་ན། །
en: When they elucidate the many profound and varied sūtras,

source: སྤོབས་པ་རྒྱ་ཆེ་ཡངས་ཤིང་ཟད་པ་མེད་པར་འགྱུར། །
en: Their eloquence is vast, expansive, and inexhaustible.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ལ་རྒྱགས་པ་མེད་ཅིང་གཡོ་མེད་ང་རྒྱལ་མེད། །
en: “When they have attained the supreme dhāraṇīs, They are neither arrogant, deceitful, nor proud.

source: དྲན་ལྡན་བློ་གྲོས་ལྡན་ཞིང་བློ་ལྡན་རྟོགས་དང་ལྡན། །
en: They are mindful and intelligent, and they possesses the realization of the wise ones.

source: ཡེ་ཤེས་མཐའ་ཡས་སྤྱོད་ཡུལ་ནམ་མཁའ་བཞིན་དུ་འགྱུར། །
en: The scope of their infinite knowledge is like the sky.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ཡི་འདུས་བྱས་ཉེས་པ་ཐམས་ཅད་རབ་ཏུ་ཆད། །
en: “When they have attained the supreme dhāraṇīs, All their faulty conditioning is terminated.

source: ཤེས་རབ་ཡེ་ཤེས་ཐབས་དང་ཟུང་དུ་འབྲེལ་བར་འགྱུར། །
en: Insight, wisdom, and skill is united,

source: བྱམས་དང་སྙིང་རྗེ་དག་ཀྱང་ཟུང་དུ་འབྲེལ་བར་འགྱུར། །
en: And love and compassion are likewise united.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་སྨྲ་ཚེ་འཁྲུལ་པ་ཆུང་ཟད་མི་དམིགས་ཏེ། །
en: “When they have attained the supreme dhāraṇīs, There is not the slightest agitation when they speak.

source: བདག་ཉིད་ཆེ་དེ་སེམས་ཅན་རྣམས་ཀྱི་སྒྲ་སྐད་ཤེས། །སྤྱོད་དང་དབང་པོ་དང་ནི་མོས་པ་ཐམས་ཅད་ཤེས། །
en: Great beings know the languages of ordinary beings, And their behaviors, capacities, and inclinations as well.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེས་ནི་ཆོས་ལ་ལྷག་མཐོང་དགེ་དང་དྲན་པ་དང་། །རྫུ་འཕྲུལ་དང་ནི་སྤང་དང་དབང་པོ་སྟོབས་ལྔ་དང་། །བྱང་ཆུབ་ཡན་ལག་དེ་བཞིན་ལམ་མཆོག་ཞི་གནས་འཐོབ། །
en: “When they have attained the supreme dhāraṇīs, They attain special insight into the Dharma and attain virtue, mindfulness, Miracles, abandonment, the spiritual faculties, the five strengths, The factors of awakening, and likewise the supreme path of tranquil abiding.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་བདེ་གཤེགས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་རང་གིས་རྟོགས། །ཕ་རོལ་ཕྱིན་པ་དག་ནི་ཀུན་གྱི་ཕ་རོལ་སོན། །བསྡུ་བའི་དངོས་པོ་ཀུན་ལ་མཁས་ཤིང་བློ་གྲོས་ལྡན། །
en: “When they have attained the supreme dhāraṇīs, They realize the sugata domain by themselves, Thoroughly perfect the perfections, And become intelligent and skilled in the means of attraction.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ལ་ནམ་ཡང་འཁྲུལ་པ་ཆུང་ཟད་མི་དམིགས་ཏེ། །
en: “When they have attained the supreme dhāraṇīs, There will never be even the slightest confusion.

source: ངེས་པ་དེ་ནི་ཞི་ཞིང་ཉེར་ཞི་མྱོས་པ་མེད། །
en: They will be determined but not intoxicated by peace or calm.

source: དེ་ནི་སྤྱོད་ལ་རབ་ཏུ་གནས་གྱུར་ཤིན་ཏུ་དུལ། །
en: They will be disciplined and settled in conduct.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་བདེ་གཤེགས་སྤྱན་སྔར་པད་མའི་སྟེང་ན་འདུག །
en: “When they have attained the supreme dhāraṇīs, They are present upon a lotus flower in the presence of the Sugata.

source: དེ་ཡི་ལུས་ནི་ཆོས་ཀྱི་རྒྱུས་བྱུང་རྡུལ་དང་བྲལ། །
en: Their bodies will be nonsubstantial, arisen by the force of the Dharma

source: དེ་ཡི་ལུས་ལ་མངལ་གྱི་དྲི་མས་གོས་མི་འགྱུར། །
en: And unstained by the impurities of the womb.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་རྒྱལ་བ་ཀུན་གྱིས་བྱིན་བརླབས་ཆོས་སྨྲ་སྟེ། །
en: “When they have attained the supreme dhāraṇīs, They are consecrated by all the victors as proponents of the Dharma.

source: དེ་ནི་ལུས་དང་ངག་ཡིད་ལས་རྣམས་གང་བྱེད་པ། །ཐམས་ཅད་ཤེས་པས་བྱས་ཏེ་སྐྱེ་བོ་ཕན་པར་བྱེད། །
en: Whatever physical, verbal, and mental actions they perform Will benefit beings since they are done with omniscience.

source: གང་གིས་གཟུངས་ཀྱི་མཆོག་རྣམས་རབ་ཏུ་ཐོབ་གྱུར་པ། །དེ་ནི་སྨྲ་ཚེ་བསྔགས་པ་ཟད་པར་མི་འགྱུར་ཏེ། །
en: “When they have attained the supreme dhāraṇīs, They are endlessly applauded when they speak.

source: སེམས་ཅན་ཐམས་ཅད་འདྲེན་པ་ཤེས་རབ་ཆེར་གྱུར་ཀྱང་། །དེ་ཡི་བསྔགས་པ་བསྐལ་པ་མང་པོར་བསམ་མི་ཁྱབ།། །།
en: Even though the knowledge of the guide of all beings expands, Their praise remains inconceivable for many eons.”

source: ཐ་མ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ལ་ལེགས་སོ་བྱ་བ་གནང་སྟེ།
en: At this time, the Blessed One expressed his approval to the bodhisattva mahāsattva Dhāraṇīśvara­rāja:

source: གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཁྱོད་ཀྱིས་གཟུངས་རྣམ་པར་ངེས་པར་བསྟན་པ་འདི་ལེགས་པར་བཤད་པ་དང་། ཇི་ལྟར་ཡང་ཁྱོད་ཆོས་འདི་དག་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་དང་། ཇི་ལྟར་ཡང་ཁྱོད་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་གཟུངས་ཀྱི་སྒོའི་ཚིག་ཟབ་མོ་རྣམས་ཡོངས་སུ་འདྲི་བའི་རང་བཞིན་ཅན་དུ་གྱུར་པ་
en: “Dhāraṇīśvara­rāja, it is excellent that you have explained this dhāraṇī teaching so well, that you have assumed responsibility for these teachings, and that you were motivated to request the profound words on the dhāraṇī gateway from previous tathāgatas.

source: ལེགས་སོ་ལེགས་སོ། །
en: It is very good!

source: དེའི་ཕྱིར་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱའོ། །
en: Therefore, Dhāraṇīśvara­rāja, you should also know what has transpired by way of the following discourse.

source: གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་རྒྱས་པ་ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པར་གྱུར་པ། དེའི་ཚེ་དེའི་དུས་ན་རྣམ་པར་སྣང་བྱེད་ཀྱི་བསྐལ་པ་ལ་འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པར་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་སྣང་བ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུ་གྱུར་པ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: “Once, in times past, inconceivably many eons ago, during the eon Illuminating, in a world called Stainless, a tathāgata, a buddha, a blessed one known as Stainless Illumination appeared in the world.

source: འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པ་དེ་ཡང་བཻ་དཱུརྱ་ལྟར་དག་པར་གྱུར་ཏེ།
en: The world Stainless was pure like lapis lazuli.

source: མེ་ལོང་ལྟ་བུར་ཤིན་ཏུ་བྱི་དོར་བྱས་པ། ལག་མཐིལ་ལྟར་མཉམ་པའོ། །
en: It was like a mirror wiped completely free of dust and was as smooth as the palm of a hand.

source: འཇིག་རྟེན་གྱི་ཁམས་དེར་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་པ་རིན་པོ་ཆེའི་ཡལ་ག་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུར་ལྡན་པ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: In that world grew fruit trees of the seven precious substances with jeweled branches, leaves, flowers, and fruits.

source: འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་པད་མ་ཚད་ཤིང་རྟའི་ཕང་ལོ་ཙམ་དུ་གྱུར་པ་སྣ་ཚོགས་པ། བལྟ་ན་སྡུག་པ་དག་ཀྱང་བྱུང་བར་གྱུར་ཏོ། །
en: There were many different beautiful lotus flowers the size of chariot wheels made of gold extracted from the Jambu River.

source: ལྷ་དང་མི་དེ་དག་ཀྱང་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་ལ་ཡོངས་སུ་ལོངས་སྤྱོད་པར་གྱུར་ཏོ། །
en: “In that world divine and human beings enjoyed themselves in opulent multistoried mansions.

source: ཟས་དང་སྐོམ་ཡང་བསམས་པ་ཙམ་གྱིས་འབྱོར་ཏེ།
en: Food and drink appeared at the mere thought of it.

source: འདི་ལྟ་སྟེ། དཔེར་ན་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དག་ཡོངས་སུ་སྤྱོད་པ་ལྟར་ལྷ་དང་མི་དེ་དག་གི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པ་ཡང་དེ་འདྲ་བར་གྱུར་ཏོ། །
en: The amusements enjoyed by these divine and human beings resembled the amusements enjoyed by the gods of the Para­nirmitavaśavartin heaven.

source: ལྷ་དང་མི་དེ་དག་ཀྱང་འདོད་ཆགས་ཆུང་བ། ཞེ་སྡང་ཆུང་བ། གཏི་མུག་ཆུང་བ། རྣམ་པ་བཟང་བ། ཤིན་ཏུ་རྣམ་པར་རིག་པར་བྱེད་པར་གྱུར་ཏོ། །
en: These divine and human beings had only a modicum of attachment, aversion, and delusion. They were handsome and refined.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་ཉི་མ་དང་ཟླ་བར་བཏགས་པ་རྣམས་མེད་པར་གྱུར་ཏེ།
en: “This world had neither sun nor moon.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་སྣང་བ་དེ་ནི་ལུས་ཀྱི་འོད་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གསལ་བར་གྱུར་ཏོ། །
en: The Blessed Tathāgata Stainless Illumination lit up the entire buddhafield with a glow that emanated from his body.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་པད་མ་ཁ་ཟུམ་པས་མཚན་མོ་ཞེས་བྱ་བ་དང་པད་མ་ཁ་བྱེ་བས་ཉིན་མོར་བགྲང་བ་མ་གཏོགས་པར་ཉིན་མཚན་དུ་གདགས་པ་མེད་དོ། །
en: The world even lacked names for day and night; the closing of the lotus flowers marked nighttime and their opening marked daytime.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་སྣང་བ་དེའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་བྱུང་བ་སྙོམས་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་ཅུར་གྱུར་ཏོ། །
en: “This tathāgata’s bodhisattva saṅgha comprised countless ordained bodhisattvas in a state of equipoise.

source: ཁྱིམ་པ་ཚད་མེད་པ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏོ། །
en: There were innumerable householders who had embarked on unsurpassed perfect awakening.

source: དེ་ནི་ཐེག་པ་ཆེན་པོ་མ་གཏོགས་པར་ཐེག་པ་རྣམ་པར་དགོད་པ་གཞན་མེད་པར་གྱུར་ཏོ། །
en: Here, no vehicles except the Great Vehicle were disseminated.

source: བཅོམ་ལྡན་འདས་དེ་ནི་ཕྱིར་མི་ལྡོག་པ་དག་པའི་གཏམ་ཡང་དག་པར་སྟོན་ཏོ། །བཅོམ་ལྡན་འདས་དེའི་སྐུ་ཚེའི་ཚད་ནི་བསྐལ་པ་ཕྱེད་དུ་གྱུར་ཏོ། །
en: The Blessed One taught the pure irreversible sermon, and his lifespan lasted half an eon.

source: མི་རྣམས་ཀྱང་བར་མ་དོར་འཆི་བའི་དུས་བྱེད་པ་མེད་པར་གྱུར་ཏོ། །
en: It was a world in which people did not grow old or die.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་གང་དག་ས་ལ་གནས་པའི་ཁང་པ་བརྩེགས་པ་རྣམས་ན་གནས་པ་དེ་དག་ནི་མི་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ། གང་དག་ནམ་མཁའ་ལ་གནས་པའི་ཁང་པ་བརྩེགས་པ་རྣམས་ན་གནས་པ་དེ་དག་ནི་ལྷ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་བ་མ་གཏོགས་པར་ལྷ་དང་མི་རྣམས་ཀྱི་ཁ་དོག་དང་། ཡོངས་སུ་སྤྱོད་པ་ཐ་དད་དུ་བྱ་བ་མེད་པར་གྱུར་ཏོ། །
en: In this buddhafield, those who dwelled in multistoried houses located on the ground were considered ‘human’ beings, while those who dwelled in multistoried houses located in the sky were considered ‘divine’ beings. Other than that, there was no distinction between the divine and the human beings in terms of their complexions or enjoyments.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྒྱལ་པོ་བླ་ན་མེད་པ་དེ་མ་གཏོགས་པར་རྒྱལ་པོ་གཞན་གང་ཡང་མེད་དོ། །
en: “In that world there were no kings, except for the blessed, unsurpassed Dharma king.

source: ལྷ་དང་མི་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་བྱེད་པ་དང་།
en: In that world, there was no one except for the divine and human beings who performed acts of worship to that tathāgata.

source: ཆོས་ཉན་པ་ལ་འདུན་པར་གྱུར་པ་མ་གཏོགས་པར་ལྷ་གཞན་མེད།
en: There were no gods except for those who aspired to listen to the Dharma.

source: སྟོན་པ་གཞན་མེད། གཞན་ལ་ཕྱག་མི་འཚལ། ལས་གཞན་མི་བྱེད། གཞན་ཡིད་ལ་མི་བྱེད་པར་གྱུར་ཏོ། །
en: There were no other teachers. No one kowtowed to others, performed superfluous deeds, or thought of anything else.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བུད་མེད་དུ་གདགས་པ་མེད་དོ། །སེམས་ཅན་དེ་དག་བསླབ་པ་གསུམ་པོ་དག་ལ་སློབ་པ་མ་གཏོགས་པར་ལྟུང་བར་གདགས་པ་མེད་དོ། །
en: “In this world no one was designated ‘a woman.’ Among its beings, no one was designated ‘a sinner,’ and no one was designated ‘a transgressor of the training.’

source: བསླབ་པ་ལས་འདའ་བར་གདགས་པ་མེད་དོ། །
en: There were only those who trained in the three precepts.

source: བསླབ་པ་གསུམ་གང་ཞེ་ན།
en: What are the three precepts?

source: འདི་ལྟ་སྟེ། ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་དང་། ལྷག་པའི་སེམས་ཀྱི་བསླབ་པ་དང་། ལྷག་པའི་ཤེས་རབ་ཀྱི་བསླབ་པའོ། །
en: They are the precepts of advanced morality, advanced contemplation, and advanced insight.

source: དེ་ལ་ལྷག་པའི་ཚུལ་ཁྲིམས་ཀྱི་བསླབ་པ་གང་ཞེ་ན།
en: “What is the precept of advanced morality?

source: གང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་མི་གཏོང་བ་དང་། མངོན་པར་འདུ་བྱེད་པ་ཐམས་ཅད་རྣམ་པར་སྤོང་བའོ། །
en: It consists in not forsaking the mind of omniscience and in abandoning everything conditioned.

source: དེ་ལ་ལྷག་པའི་སེམས་ཀྱི་བསླབ་པ་གང་ཞེ་ན།
en: What is the precept of advanced contemplation?

source: གང་ཏིང་ངེ་འཛིན་ལ་རབ་ཏུ་གནས་ནས་ལྷག་པའི་ཤེས་རབ་ཐོབ་པའོ། །
en: It consists in attaining advanced understanding through settling in absorption.

source: དེ་ལ་ལྷག་པའི་ཤེས་རབ་ཀྱི་བསླབ་པ་གང་ཞེ་ན།
en: What is the precept of advanced insight?

source: གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རབ་ཏུ་གནས་ནས། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པའོ། །
en: It consists in attaining discriminating knowledge through being established in the perfection of insight.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་ལུང་ཕོག་པ་མེད་པར་བསླབ་པ་འདི་ལྟ་བུ་དག་ལ་སློབ་པ་དག་གོ། །
en: “Those bodhisattvas engaged in precepts like these without prior scriptural transmission.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་དེ་ལྟ་བུར་ཡོངས་སུ་དག་པར་གྱུར་ཏོ། །
en: This world realm was pure in this way.

source: བཅོམ་ལྡན་འདས་དེའི་ཆོས་བསྟན་པ་ཡང་དེ་ལྟ་བུར་ཡོངས་སུ་དག་པར་གྱུར་ཏོ། །
en: The doctrinal exposition of this blessed one was pure in this way.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འོད་དཔལ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ།
en: “At that time, a bodhisattva known as Glorious Light was present in the retinue that had gathered.

source: འདུག་པར་གྱུར་པ་དེ་སྟན་ལས་ལངས་ཏེ།
en: He rose from his seat and asked the Tathāgata,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་སྣང་བ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གཟུངས་གཟུངས་ཞེས་བགྱི་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དག །གཟུངས་གང་ལ་རབ་ཏུ་གནས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཀུན་དུ་འཛིན་པ་དང་། ཆོས་བསྟན་པ་ན་ཟད་པར་མི་འགྱུར་བ་དང་། ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བགྱིད་པའི་གཟུངས་དེ་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: ‘Blessed One, if one speaks of retaining dhāraṇī, what is the dhāraṇī in which the blessed bodhisattvas are established so that everything taught by all the blessed buddhas is upheld, the Dharma does not fade away once it has been taught, and all sentient beings are satisfied through its eloquent explanation?’

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་སྣང་བ་དེས། བྱང་ཆུབ་སེམས་དཔའ་འོད་དཔལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “That blessed one replied,

source: རིགས་ཀྱི་བུ་ཁྱོད་གང་གི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་དྲི་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་རིན་ཆེན་སྒྲོན་མ་ཞེས་བྱ་བའི་གཟུངས་ཡོད་དེ།
en: ‘Son of noble family, it is good that you thought to ask the Tathāgata about this point. There is a dhāraṇī called jewel lamp.

source: བྱང་ཆུབ་སེམས་དཔའ་དག་གཟུངས་དེ་ལ་རབ་ཏུ་གནས་ནས། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཀུན་དུ་འཛིན་ཏོ། །ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་དོ། །
en: Bodhisattvas who are established in this dhāraṇī retain all the buddha teachings and appease all sentient beings through eloquent explanation.’

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་སྣང་བ་ལ། བྱང་ཆུབ་སེམས་དཔའ་འོད་དཔལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “Then Glorious Light requested the Tathāgata,
